evidence/gqa-page784-k5120/final-dp2-validation/throughput/results/4-8K_c8/client.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f85e6fb20e0>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='/public/home/tangyu408/Qwen_DCU_Worker_0/modular_validation/results/gqa_page784_k5120_final_dp2_5355cea_20260811/throughput/data/4-8K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=8, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='/root/Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/Qwen_DCU_Worker_0/modular_validation/results/gqa_page784_k5120_final_dp2_5355cea_20260811/throughput/results/4-8K_c8', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-a4d94d47-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 08-11 01:48:26 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:05<00:00,  2.73s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 50/50 [02:44<00:00,  3.29s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  164.58    
Total input tokens:                      315769    
Total generated tokens:                  12394     
Request throughput (req/s):              0.30      
Output token throughput (tok/s):         75.31     
Peak output token throughput (tok/s):    164.00    
Peak concurrent requests:                10.00     
Total token throughput (tok/s):          1993.91   
---------------Time to First Token----------------
Mean TTFT (ms):                          3215.21   
Median TTFT (ms):                        3124.36   
P50 TTFT (ms):                           3124.36   
P95 TTFT (ms):                           6903.18   
P99 TTFT (ms):                           9102.25   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          95.45     
Median TPOT (ms):                        73.20     
P50 TPOT (ms):                           73.20     
P95 TPOT (ms):                           197.20    
P99 TPOT (ms):                           293.45    
---------------Inter-token Latency----------------
Mean ITL (ms):                           76.95     
Median ITL (ms):                         49.84     
P50 ITL (ms):                            49.84     
P95 ITL (ms):                            55.66     
P99 ITL (ms):                            1441.50   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          22290.03  
Median E2EL (ms):                        11021.15  
P50 E2EL (ms):                           11021.15  
P95 E2EL (ms):                           74753.10  
P99 E2EL (ms):                           101705.99 
==================================================